---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.StructuralVelocity
source: html/9876b5dc-85e7-a967-0f2a-1ae6b7ab6185.htm
---
# Autodesk.Revit.DB.SpecTypeId.StructuralVelocity Property

Velocity, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralVelocity { get; }
```